In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({"name":["ichigo","yhwach","aizen","mikasa","armin","eren"]})
df

     name
0  ichigo
1  yhwach
2   aizen
3  mikasa
4   armin
5    eren

In [20]:
from sklearn.preprocessing import LabelEncoder

In [21]:
le = LabelEncoder()
df["endata"] = le.fit_transform(df["name"])

In [22]:
df

     name  endata
0  ichigo       3
1  yhwach       5
2   aizen       0
3  mikasa       4
4   armin       1
5    eren       2

In [23]:
ds = pd.read_csv("loan.csv")

In [24]:
ds.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP0000001,Male,No,1,Graduate,No,5535,6127,89.0,360.0,1.0,Semiurban
1,LP0000002,Male,Yes,0,Graduate,No,15646,688,243.0,360.0,1.0,Semiurban
2,LP0000003,Male,Yes,3+,Graduate,No,7951,7184,385.0,360.0,1.0,Semiurban
3,LP0000004,Male,No,0,Graduate,No,9182,1398,366.0,180.0,1.0,Semiurban
4,LP0000005,Male,Yes,1,Graduate,No,14682,9813,431.0,360.0,1.0,Rural

In [25]:
ds["Property_Area"].unique()

array(['Semiurban', 'Rural', 'Urban'], dtype=object)

In [26]:
la = LabelEncoder()
ds["Property_Area"] = la.fit_transform(ds["Property_Area"])

In [27]:
ds["Property_Area"]

0       1
1       1
2       1
3       1
4       0
       ..
9995    2
9996    2
9997    2
9998    1
9999    0
Name: Property_Area, Length: 10000, dtype: int32

In [28]:
ds["Property_Area"].unique()

array([1, 0, 2])